src/cfe/КСП/Documents/КСП_ЧекЛистПроверкиКачестваПряжи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>КСП_ЧекЛистПроверкиКачестваПряжи</Name>
			<BasedOn>
				<xr:Item>Document.КСП_ПроверочнаяВедомость</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.КСП_ПроверкаКачестваПряжиПоЧекЛистам</xr:Item>
				<xr:Item>InformationRegister.КСП_ПаспортКачества</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КСП_ПроверочнаяВедомость</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУдостоверяющийКачество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяПеремоткаНеПроводилась</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоЛотам</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВизуальныйОсмотрПроверкаЗавершена</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВизуальныйОсмотрДатаЗавершенияПроверки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрольнаяПеремоткаПроверкаЗавершена</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрольнаяПеремоткаДатаЗавершенияПроверки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоБобин</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПунктыПроверкиВизуальногоОсмотра</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПунктПроверки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КСП_ПунктыПроверкиКачестваПоЧекЛистам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатПроверки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтрокиДляСвязиСФото</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтрольнаяПеремотка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПунктПроверки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КСП_ПунктыПроверкиКачестваПоЧекЛистам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проверил</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатПроверки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтрокиДляСвязиСФото</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФотоДефектов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьКФайлу</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтапПроверки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КСП_ЭтапыПроверкиКачестваПоЧекЛистам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cfe/КСП/Enums/КСП_ЭтапыПроверкиКачестваПоЧекЛистам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>КСП_ЭтапыПроверкиКачестваПоЧекЛистам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВизуальныйКонтроль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольнаяПеремотка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТестовыйОтвяз</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/КСП/Documents/КСП_ЧекЛистПроверкиКачестваПряжи/Ext/ManagerModule.bsl
// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт   
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(ПустаяСсылка()));
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЧЕКЛИСТ";
	КомандаПечати.Представление = "Чек лист";
	КомандаПечати.МенеджерПечати    = ОбъектМетаданных.ПолноеИмя();
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	КомандаПечати.Порядок = 10; 	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт    	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;                                                            	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЧекЛист") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЧекЛист", "Чек Лист", ПечатьЧекЛиста(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
КонецПроцедуры

Функция ПечатьЧекЛиста(МассивСсылок, ОбъектыПечати = Неопределено) Экспорт 
	Ссылка = МассивСсылок.Получить(0);
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ПолеСверху = 10;
	ТабДок.ПолеСлева = 20;
	ТабДок.ПолеСнизу = 10;
	ТабДок.ПолеСправа = 10;
	ТабДок.ТолькоПросмотр = Истина;
	
	Макет = ПолучитьМакет("ЧекЛист");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьЗаголовокВизуальнаяПроверка = Макет.ПолучитьОбласть("ЗаголовокВизуальнаяПроверка");
	ОбластьСтрокаПунктПроверки = Макет.ПолучитьОбласть("СтрокаПунктПроверки");
	ОбластьКонтрольнаяПеремоткаШапка = Макет.ПолучитьОбласть("КонтрольнаяПеремоткаШапка");
	ОбластьКонтрольнаяПеремоткаПодвал = Макет.ПолучитьОбласть("КонтрольнаяПеремоткаПодвал");
	ОбластьИзображенияДефектов = Макет.ПолучитьОбласть("ИзображенияДефектов");
	
	ОбластьШапка.Параметры.Заполнить(Ссылка);
	ОбластьШапка.Параметры.ДатаПроверки = Ссылка.Дата;
	Для Каждого СтрокаТовары Из Ссылка.Товары Цикл
		Если СтрокаТовары.НомерСтроки <> 1 Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ОбластьШапка.Параметры.Заполнить(СтрокаТовары);   
		Попытка
		ОбластьШапка.Параметры.НомерДокументаПоступления = Ссылка.ДокументОснование.ДокументОснование.Распоряжение.ЗаказПоставщику.НомерПоДаннымПоставщика;
		ОбластьШапка.Параметры.ДатаДокументаПоступления = Формат(Ссылка.ДокументОснование.ДокументОснование.Распоряжение.ЗаказПоставщику.ДатаПоДаннымПоставщика, "ДФ=dd.MM.yyyy");
		Исключение КонецПопытки;
		ТабДок.Вывести(ОбластьШапка);
		ТабДок.Вывести(ОбластьЗаголовокВизуальнаяПроверка);
		МассивОбластейДляПроверки = Новый Массив;
		МассивОбластейДляПроверки.Добавить(ОбластьСтрокаПунктПроверки);
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("КлючСтроки", СтрокаТовары.КлючСтроки);
		ПунктыПроверкиВизуальногоОсмотра = Ссылка.ПунктыПроверкиВизуальногоОсмотра.НайтиСтроки(СтруктураОтбора);
		Для Каждого СтрокаПунктыПроверкиВизуальногоОсмотра Из ПунктыПроверкиВизуальногоОсмотра Цикл			
			ОбластьСтрокаПунктПроверки.Параметры.Заполнить(СтрокаПунктыПроверкиВизуальногоОсмотра);
			Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДок, МассивОбластейДляПроверки) Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
				ТабДок.Вывести(ОбластьЗаголовокВизуальнаяПроверка);
			КонецЕсли;
			ТабДок.Вывести(ОбластьСтрокаПунктПроверки);
		КонецЦикла;
		МассивОбластейДляПроверки = Новый Массив;
		МассивОбластейДляПроверки.Добавить(ОбластьКонтрольнаяПеремоткаШапка);
		Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДок, МассивОбластейДляПроверки) Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ТабДок.Вывести(ОбластьКонтрольнаяПеремоткаШапка);
		МассивОбластейДляПроверки = Новый Массив;
		МассивОбластейДляПроверки.Добавить(ОбластьСтрокаПунктПроверки);
		КонтрольнаяПеремотка = Ссылка.КонтрольнаяПеремотка.НайтиСтроки(СтруктураОтбора);
		Для Каждого СтрокаКонтрольнаяПеремотка Из КонтрольнаяПеремотка Цикл
			ОбластьСтрокаПунктПроверки.Параметры.Заполнить(СтрокаКонтрольнаяПеремотка);
			Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДок, МассивОбластейДляПроверки) Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ТабДок.Вывести(ОбластьСтрокаПунктПроверки);
		КонецЦикла;
		МассивОбластейДляПроверки = Новый Массив;
		МассивОбластейДляПроверки.Добавить(ОбластьКонтрольнаяПеремоткаПодвал);
		Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДок, МассивОбластейДляПроверки) Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ТабДок.Вывести(ОбластьКонтрольнаяПеремоткаПодвал);
	КонецЦикла; 
	
	ОтборФотокПоПервомуЭтапу = Новый Структура;
	ОтборФотокПоПервомуЭтапу.Вставить("ЭтапПроверки", Перечисления.КСП_ЭтапыПроверкиКачестваПоЧекЛистам.ВизуальныйКонтроль);
	ФотоПервогоЭтапа = Ссылка.ФотоДефектов.НайтиСтроки(ОтборФотокПоПервомуЭтапу);
	КоличествоФотоПервогоЭтапа = ФотоПервогоЭтапа.Количество();
	ОтборФотокПоВторомуЭтапу = Новый Структура;
	ОтборФотокПоВторомуЭтапу.Вставить("ЭтапПроверки", Перечисления.КСП_ЭтапыПроверкиКачестваПоЧекЛистам.КонтрольнаяПеремотка);
	ФотоВторогоЭтапа = Ссылка.ФотоДефектов.НайтиСтроки(ОтборФотокПоВторомуЭтапу);
	КоличествоФотоВторогоЭтапа = ФотоВторогоЭтапа.Количество();
	Если КоличествоФотоПервогоЭтапа > КоличествоФотоВторогоЭтапа Тогда
		МаксимальноеКоличествоФотокПоЭтапу = КоличествоФотоПервогоЭтапа;
	Иначе
		МаксимальноеКоличествоФотокПоЭтапу = КоличествоФотоВторогоЭтапа;
	КонецЕсли;
	ПустаяКартинка = Новый Картинка;
	ПутьКПапкеИзображенийПоЧекЛистамПроверкиКачестваПряжи = Константы.ксп_ПутьКПапкеИзображенийПоЧекЛистамПроверкиКачестваПряжи.Получить();
	МассивОбластейДляПроверки = Новый Массив;
	МассивОбластейДляПроверки.Добавить(ОбластьИзображенияДефектов);
	Для ПозицияФото = 0 По МаксимальноеКоличествоФотокПоЭтапу-1 Цикл
		Если ПозицияФото <= КоличествоФотоПервогоЭтапа - 1 Тогда
			Файл = ПутьКПапкеИзображенийПоЧекЛистамПроверкиКачестваПряжи + СтрЗаменить(ФотоПервогоЭтапа[ПозицияФото].ПутьКФайлу, ".\\", "\");
			ОбластьИзображенияДефектов.Рисунки.ИзображениеДефекта1.Картинка = Новый Картинка(Файл);
		Иначе
			ОбластьИзображенияДефектов.Рисунки.ИзображениеДефекта1.Картинка = ПустаяКартинка;
		КонецЕсли;
		Если ПозицияФото <= КоличествоФотоВторогоЭтапа - 1 Тогда
			Файл = ПутьКПапкеИзображенийПоЧекЛистамПроверкиКачестваПряжи + СтрЗаменить(ФотоВторогоЭтапа[ПозицияФото].ПутьКФайлу, ".\\", "\");
			ОбластьИзображенияДефектов.Рисунки.ИзображениеДефекта2.Картинка = Новый Картинка(Файл);
		Иначе
			ОбластьИзображенияДефектов.Рисунки.ИзображениеДефекта2.Картинка = ПустаяКартинка;
		КонецЕсли;
		Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДок, МассивОбластейДляПроверки) Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ТабДок.Вывести(ОбластьИзображенияДефектов);
	КонецЦикла;
		
	Возврат ТабДок;
КонецФункции
